#Создайте список  [ 18, 14, 10, 6, 2 ] с помощью функции  range()и выведите его на экран.

print(list(range(18,1,-4)))